# FabricationConfigurationInfo Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfigurationInfo Class
Members See Also
---
Represents an MEP object that holds the properties of an MEP fabrication configuration.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class FabricationConfigurationInfo : IDisposable
```

Visual Basic
---
```text
Public Class FabricationConfigurationInfo _
	Implements IDisposable
```

Visual C++
---
```text
public ref class FabricationConfigurationInfo : IDisposable
```

# Remarks
To populate the Path property, you may need to call FindSourceFabricationConfiguration first.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FabricationConfigurationInfo
# See Also
FabricationConfigurationInfo Members
Autodesk.Revit.DB Namespace